<a href="https://colab.research.google.com/github/YunChenLi/Tensorflow-Notebook/blob/main/Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Pandas是python的一個資料分析函式庫（列存數據分析ＡＰＩ）用於處理和分析輸入數據的工具
#很多機器學習框架都支持將pandas數據結構作為輸入

-建立dataframe
-客製化dataframe顯示設定
-數據清理／整理
-取得想要關注的數據
-基本數據處理與轉換
-簡單匯總和分析數據

In [ ]:
import pandas as pd
pd. __version__

'1.1.5'

###Basic Concept

- DataFrame - rows and columns
- Series - a line of data

###Basic Usage
可以直接初始化一個series並加上列初始化一個dataframe

###建立DataFrame
- 用python dict
- 用pd.util.testing隨機建立DataFrame
    - pd.util.testing.makeDataFrame().head(10)/tail(10)
    - pd.util.testing.makeMixedDataFrame()
- 將剪貼簿內容轉換成DataFrame
  - df = pd.read_clipboard()
  - df.to_csv()
- 讀取線上csv
  - df = pd.read_csv()
- 優化記憶使用量
- 讀入並合併多個csv建立單一DataFrame

In [ ]:

city_names = ['San Francisco', 'San Jose', 'Sacramento']
population = [852469, 1015785, 485199]

des = pd.DataFrame({'City name': city_names, 'Population': population}, index=['A','B','C'])
des

       City name  Population
A  San Francisco      852469
B       San Jose     1015785
C     Sacramento      485199

In [ ]:
des.describe()

         Population
count  3.000000e+00
mean   7.844843e+05
std    2.717477e+05
min    4.851990e+05
25%    6.688340e+05
50%    8.524690e+05
75%    9.341270e+05
max    1.015785e+06

In [ ]:
import pandas as pd

city_names = pd.Series(['San Francisco', 'San Jose', 'Sacramento'], index= ['A','B','C'])
population = pd.Series([852469, 1015785, 485199], index= ['A','B','C'])

des1 = pd.DataFrame({'City name': city_names, 'Population': population})
des1

       City name  Population
A  San Francisco      852469
B       San Jose     1015785
C     Sacramento      485199

In [ ]:
import numpy as np
import pandas as pd

s = pd.Series([1, 3, 5, 0, 6, 8])
s, type(s), s.shape

(0    1
 1    3
 2    5
 3    0
 4    6
 5    8
 dtype: int64, pandas.core.series.Series, (6,))

In [ ]:
dates = pd.date_range("20210809", periods= 6)
dates

DatetimeIndex(['2021-08-09', '2021-08-10', '2021-08-11', '2021-08-12',
               '2021-08-13', '2021-08-14'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df= pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list("ABCD"))
df

                   A         B         C         D
2021-08-09 -1.261408  0.310392  1.762430  0.265887
2021-08-10  0.011623  1.098322  0.207900  0.618097
2021-08-11 -0.377220  0.198353 -0.322989  2.128867
2021-08-12 -1.124498  0.067314  0.593758 -0.047051
2021-08-13 -0.478714 -0.145483  0.208057  0.008183
2021-08-14 -1.159262  0.158086 -0.924493  1.623726

In [ ]:
df = pd.read_csv("http://bit.ly/kaggletrain")
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
display(df.head())

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
df.set_index

<bound method DataFrame.set_index of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>